Repository: lenoryv/collective.spanishdocumentation
Catalog: buildout.coredev/omegat/project_save.tmx
Source language: en_us
Languages: es_ve

source: To fix, you have a couple options.
es_ve: Para solucionarlo, hay un par de opciones.

source: To get started, `open a new ticket <https://dev.plone.org/newticket>`_ and select "PLIP" as the ticket type.
es_ve: Para iniciar, `abra un nuevo ticket <https://dev.plone.org/newticket>`_ y seleccione "PLIP" como el tipo de ticket.

source: To run a test for the specific module you are modifying::
es_ve: Para correr una prueba para el módulo específico ejecute el siguiente comando::

source: To see what branch you are currently on, just do::
es_ve: Para ver qué branch que se encuentra actualmente, acaba de hacer::

source: To set up a plone 4.2 development environment::
es_ve: Para instalar un entorno de desarrollo plone 4.2::

source: To update them, please checkout the coredev buildout and update there.
es_ve: Para actualizarles, por favor, hacer un checkout desde el buildout coredev y actualizar allá.

source: Today, tomorrow, any time!
es_ve: ¡Hoy, mañana, en cualquier momento!

source: Troubleshooting ===============
es_ve: Troubleshooting: solucionar problemas =====================================

source: Try removing parts/*, bin/*, .installed.cfg, then re-bootstrap and re-run buildout, develop, buildout.
es_ve: Trate de remover los directorios parts/*, bin/*, el archivo .installed.cfg, entonces ejecute de nuevo el archivo bootstrap.py y ejecute de nuevo buildout, develop, buildout.

source: Tune-ups are filled with a good mix of newbies and experienced devs alike.
es_ve: Los Tune-ups está llenado con una buena mezcla de programadores recién iniciados y experimentados igualmente.

source: Updating CHANGES.rst and checkouts.cfg -------------------------------------- Once all the tests are running locally on your machine, you are ALMOST ready to commit the changes.
es_ve: Actualizar el archivo CHANGES.rst y checkouts.cfg ------------------------------------------------- Una ves todo las pruebas se ejecuten localmente en si maquina, usted debe estar CASI listo para generar una revisión de sus cambios.

source: Usability Issues ----------------
es_ve: Incidentes de usabilidad ------------------------

source: Use ``bin/develop update --force``.
es_ve: Utilice el comando ``bin/develop update --force``.

source: Use spaces as indenting, 4 spaces for each level.
es_ve: Use espacios como indentado, a 4 espacios para cada nivel.

source: Use the same naming convention when branching existing packages, and you should always be branching packages when working on PLIPs.
es_ve: Utilice la misma convención de nombre cuando haga un branch existente a paquetes existentes, y siempre usted debería siempre hacer branch paquetes cuando esta trabajando en las PLIPs.

source: Using Sphinx ~~~~~~~~~~~~
es_ve: Utilizando Sphinx ~~~~~~~~~~~~~~~~~

source: Version Support Policy ---------------------- If you are triaging or fixing bugs, keep in mind that Plone has a `version support policy <http://plone.org/support/version-support-policy>`_.
es_ve: Política sobre soporte a la Versión ----------------------------------- Si usted está tratando de corregir fallos, tenga en cuenta que Plone tiene una `política sobre soporte a la versión <http://plone.org/support/version-support-policy>`_.

source: We are in the home stretch.
es_ve: Estamos en la recta final.

source: We do ask that before requesting core access you familiarize yourself a little with the community since they will help you get ramped up:
es_ve: Nosotros pedimos que antes de solicitar el acceso de escritura al núcleo de Plone, usted debe familiarizarse un poco con la comunidad, ya que le ayudará a acelerar su iniciación:

source: We don't "require" `PEP8 <http://www.python.org/dev/peps/pep-0008/>`_, but most people use it and it's good for you.
es_ve: Nosotros no "requerimos" `PEP8 <http://www.python.org/dev/peps/pep-0008/>`_, pero mucha gente lo usa y eso es bueno para usted.

source: We don't have integration with github yet so it's a nice way to track changes.
es_ve: Actualmente no tenemos una integración de nuestro sistema de ticket con el servicio github pero es una forma agradable de seguir sus cambios.

source: We don't require it but we as a community really, really appreciate it.
es_ve: Nosotros no requerimos, pero nosotros, como comunidad realmente, realmente lo apreciamos.

source: We encourage most PLIPs to go through the add on process at first if at all possible to make sure the majority of the comunity uses it.
es_ve: Animamos a que la mayoría de los PLIPs pasen que se coloquen al principio del proceso si es posible para asegurarse de que la mayoría de la comunidad lo use.

source: We know that things get busy and new problems make PLIPs more complicated and we will push it to the next release.
es_ve: Nosotros sabemos que todos tenemos ocupaciones que nos ponen muy ocupados y además de nuevos problemas hacen a los PLIPs más complicado si es así entonces los vamos a mover hacia la siguiente versión.

source: We need a better one.
es_ve: Necesitamos una mejor.

source: We recommend fixing the bug on the latest branch and then backporting as necessary.
es_ve: Le recomendamos corregir un fallo en la branch más reciente y entonces backporting tan como sea necesario.

source: We recommend the latter but will describe both.
es_ve: Nosotros recomendamos el último pero describirá ambos.

source: We recommend using branches off of the github.com/plone repo and will detail that below.
es_ve: Nosotros recomendamos usar branches en el repositorio github.com/plone y se detallará abajo.

source: We will even help you pair up with implementors if needed.
es_ve: Incluso te ayudaremos a la par con los implementores si necesario.

source: We will send the PLIP back to you if it is not filled in.
es_ve: Nosotros enviaremos el PLIP de regreso a usted si ese campo no es llenado.

source: We're the first to admit that Zope and Plone are not the finest examples of stylistic integrity, but that doesn't stop us from trying!
es_ve: ¡Somos los primeros en admitir que Zope y Plone no son los mejores ejemplos de la integridad estilística, pero eso no nos impide intentarlo!

source: Welcome to the Plone community!
es_ve: ¡Sea bienvenido a la comunidad Plone!

source: What is a PLIP champion?
es_ve: ¿Qué es un defensor PLIP?

source: When Mr. Developer is Unhappy ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ mr.developer is never unhappy, except when it is.
es_ve: Cuando Mr. Developer no es feliz ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ mr.developer nunca es feliz, excepto cuando es.

source: When can I submit a PLIP?
es_ve: ¿Cuándo yo puedo presentar un PLIP?

source: When in doubt, please ask.
es_ve: Cuando tenga dudas, por favor, pregunte.

source: When in doubt, submit it as a PLIP.
es_ve: En caso de duda, se presentará como una PLIP.

source: When is the PLIP due?
es_ve: ¿Cuándo el PLIP es debido?

source: When running any ``./bin/develop`` command.
es_ve: Cuando ejecuta algún comando ``./bin/develop``.

source: When the PLIP is accepted, a Framework Team member will “champion” your PLIP and be dedicated to seeing it completed.
es_ve: Cuando el PLIP es aceptado, un miembro del equipo del Framework "defenderá" su PLIP y a ser encargado de llevar a cabo esta mejorar hasta que este completada.

source: When working with the dev instance, especially with all the moving back and forth between github and svn, you may have an old copy of a src package.
es_ve: Cuándo trabajando con la instancia de desarrollo, especialmente con toda el movimiento de ida y vuelta de cambios entre github y svn,usted puedes tener una copia vieja de un paquete en le directorio src.

source: When writing a PLIP, be as specific and to-the-point as you can.
es_ve: Cuando escribe una PLIP, de se lo mas especifico que pueda al punto a tratar.

source: When you are done, if you have access to core please commit the review to the plips folder and reference the PLIP in your commit message.
es_ve: Cuando haya terminado, si usted tiene acceso al núcleo por favor comprometerse con la revisión de los plips y hacer referencia a la PLIP en el mensaje de confirmación.

source: When you are happy with the feedback, :ref:`submit a PLIP <how_submit_plip>`.
es_ve: Cuándo este feliz con el comentario, :ref:`presente un PLIP <how_submit_plip>`.

source: When you are happy with the feedback, submit a PLIP.
es_ve: Cuándo este feliz con el comentario, presente un PLIP.

source: When you are ready to push your fix, push to a remote branch with::
es_ve: Cuándo usted este a punto para hacer push de la corrección de su fallo, debe hacer un push a una branch remota con el siguiente comando::

source: When you rerun bootstrap, it will look for the buildout of the egg, note that there isn't one, and then go fetch a new egg in the version that it wants for you.
es_ve: Al volver a ejecutar el archivo bootstrap.py, este buscará para el paquete egg para el buildout, ya que no hay uno, y luego ir a buscar el paquete egg con la nueva versión que se quiere para su construcción buildout.

source: When you submit your PLIP and it is approved, 1 Framework Team member who is especially excited about seeing the PLIP completed will be assigned to your PLIP as a champion.
es_ve: Cuando usted presenta su PLIP y esta es aprobada, Un miembro del equipo de Framework que este especialmente animado a ver hecho realidad el PLIP sera asignado a su PLIP como un defensor.

source: Whether that actually happens or not I can not judge.
es_ve: Ya sea que realmente sucede o no, yo no puedo opinar.

source: While there is no official mentoring process, there are plenty of people willing to act in that role and guide you through the steps of getting involved in the community.
es_ve: Si bien no existe un proceso oficial de tutoría, hay un montón de personas dispuestas a actuar en ese rol y le guiará por los pasos de involucrarse en la comunidad.

source: Who can submit PLIPs?
es_ve: ¿Quiénes pueden presentar PLIPs?

source: Writing documentation =====================
es_ve: Escribiendo documentación

source: You can also check the CHANGES.txt of every plone release for a comprehensive list of all changes and validate that yours is present.
es_ve: Usted también puede descargar el CHANGES.txt de cada liberación de Plone para ver una lista comprensible de todos los cambios y validar que su contribuciones estén presente.

source: You can also get such fun errors as::
es_ve: Usted también se puede conseguir con errores tan divertidos tales como::

source: You can begin working immediately, and we encourage submitting fast and furious.
es_ve: Usted puede iniciar rápidamente su trabajo, y nosotros animamos a presentarlo 'rápido y furioso'.

source: You can do this through the app store or several other soul-selling methods.
es_ve: Usted puede hacer este a través de la app store o muchos otros métodos que venden.

source: You can follow the project on github and watch its timeline.
es_ve: Usted puede seguir el proyecto en github y mirar la linea del tiempo de cambios.

source: You can get the source of the package with mr.developer and the checkout command, or you can go directly to editing checkouts.cfg.
es_ve: Usted puede conseguir la fuente del paquete con mr.developer y la orden checkout, o puedes ir directamente a editar checkouts.cfg.

source: You can ignore this advice to start, but have faith, you'll come back to it later.
es_ve: Usted puede ignorar este consejo para empezar, pero tenga fe, volverás a él más tarde.

source: You can look at git log to find this.)
es_ve: Usted puede mirar el histórico de su repositorio git para encontrar este.)

source: You can repeat this process with as many or as few packages as you need.
es_ve: Usted puede repetir este proceso con tan muchos o cuando pocos paquetes cuando necesite.

source: You do not have to be the most amazing coder in the entire world to submit a PLIP.
es_ve: Usted no tiene que ser el más increíble programador en el mundo entero para poder presentar una PLIP.

source: You don't have to develop there, but it must be there when submitted.
es_ve: Así usted no tenga el desarrollo allí, pero ese debe estar allí cuando este presentado.

source: You don't have to list every line of code that needs to be changed, but you should also give an indication that you have some idea that how the change can be feasibly implemented.
es_ve: Usted no tiene que listar cada línea de código que necesidades de ser cambiadas, pero usted también debe dar una indicación que usted tenga sobre alguna idea de como el cambio puede ser viablemente implementado.

source: You don’t like my PLIP :( What now?
es_ve: No le gusta mi PLIP :( Y ahora que?

source: You may even be able to get immediate core access at a conference if you are flexing your mad coding skills and the right people are attending.
es_ve: Usted puede incluso ser capaz de obtener acceso inmediato en una conferencia si usted está flexionando sus habilidades de codificación locos y la gente adecuada asisten.

source: You may get the same error above again but now that you know how to fix it, you can spend that time drinking beer instead of smashing your keyboard.
es_ve: Usted puede obtener el mismo error anterior nuevamente, ahora que sabes cómo solucionarlo, usted puede pasar ese tiempo bebiendo cerveza en vez de aplastar el teclado.

source: You may think the buildout god is angry because it's been MONTHS since you've made a human sacrifice to her but be strong and follow along.
es_ve: Usted puede pensar que la diosa buildout está enfadada porque han pasado MESES desde que usted hizo un sacrificio humano para ella, pero sea fuerte y siga adelante.

source: You will likely want to install your own python 2.6 as well since they strip out all the header files which makes compiling some extensions weird.
es_ve: Usted probablemente querrá instalar su propio python 2.6 entonces necesita fuera todos los archivos encabezados cuál hace compilar algunas extensiones.

source: You will need to checkout the branch to which the PLIP is assigned.
es_ve: Usted necesitará a tener una copia al branch del repositorio del cual el PLIP fue asignado.

source: You will quickly see how people work and what kind of things are best suited for group discussion.
es_ve: Usted pronto vera cómo la gente trabaja y qué tipo de cosas son las más adecuadas para la discusión grupal.

source: You'll be expected to help out with that feature after it's been released (within reason).
es_ve: Se espera contar con su ayuda para dar soporte a esa característica después de haber sido lanzado en Plone (dentro de lo razonable).

source: You'll have to interact with a large number of people to get it all set up.
es_ve: Usted tendrá que interactuar con un gran número de personas para conseguir que todo quede preparado.

source: ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ Plone used to be in an svn repository, so everyone is familiar and accustomed to committing directly to the branches.
es_ve: ^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^^ Plone uso un repositorio svn, así que todo el mundo es familiar y acostumbrado a hacer revisiones directamente a las branches.

source: `Github <https://github.com/plone/buildout.coredev/>`_ by default always points to the currently active branch.
es_ve: `Github <https://github.com/plone/buildout.coredev/>`_ por defecto siempre apunta a la rama actualmente activa.

source: ``README.rst`` should include:
es_ve: ``README.rst`` tendría que incluir:

source: compare that to::
es_ve: comparar eso a::

source: eg::
es_ve: ej::

source: mr.developer Path Errors ^^^^^^^^^^^^^^^^^^^^^^^^
es_ve: Errores de ruta mr.developer ^^^^^^^^^^^^^^^^^^^^^^^^^^^^

source: narrative documentation)
es_ve: documentación narrativa)

source: reST References:
es_ve: Referencias reST:

source: then you likely want to create a branch of whatever packages you are using and then use the pull request feature of github to get review.
es_ve: Entonces probablemente quieres crear una branch de cualquier paquete que está utilizando y entonces use la característica de pull request del servicio github para conseguir revisión.
